        SUBROUTINE REGRW8 ( N, T, D, W, IV, DR, SH, IUER )
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα χωώισμεξιρ υημοχοηο λοόζζιγιεξτα ι σχοβοδξοηο ώμεξα *
! *     ςεηςεσσιοξξοκ πςρνοκ ζυξλγιι D(T) .                              *
! *                                                                      *
! *     ισπομψϊυετσρ νασσιχ  IV, σοστορύικ ιϊ  0 ιμι 1 , λοτοςωκ         *
! *     οτνεώαετ ξεισπομψϊοχαξξωε οτσώετω. εσμι  IV(I)=1, το  I-τωκ      *
! *     οτσώετ υώαστχυετ χ χωώισμεξιι παςανετςοχ ςεηςεσσιοξξοκ πςρνοκ.   *
! *     εσμι  IV(J)=0, το J-τωκ όμενεξτ ισλμΰώαετσρ ιϊ ποδσώετοχ.        *
! *                                                                      *
! *                                                                      *
! * ------------------------- χθοδξωε παςνετςω: ------------------------ *
! *                                                                      *
! *        N  ( INTEGER*4 )  --  ώισμο όμενεξτοχ υ χελτοςοχ  D  ι  T .   *
! *        T  ( REAL*8    )  --  χελτος αςηυνεξτοχ ζυξλγιι D .           *
! *        D  ( REAL*8    )  --  χελτος ϊξαώεξικ ζυξλγιι, δμρ λοτοςοκ    *
! *                              χωώισμρετσρ δισπεςσιρ ι σςεδξεε.        *
! *        W  ( REAL*8, OPT    )  --  χελτος χεσοχ ξειϊχεστξωθ.          *
! *                                   παςανετςα οπυύεξ, το χσεν τοώλαν   *
! *                                   πςισχαιχαετσρ χεσ 1 .              *
! *       IV  ( INTEGER*4, OPT )  --  χελτος, υλαϊωχαΰύικ ξα ισλμΰώεξξωε *
! *                              ιϊ ποδσώετοχ όμενεξτω.                  *
! *                              εσμι παςανετς  IV  οπυύεξ, ισπομψϊυΰτσρ *
! *                              χσε όμενεξτω.                           *
! *                                                                      *
! * ------------------------- χωθοδξωε παςνετςω: ----------------------- *
! *                                                                      *
! *       DR  ( REAL*8    )  --  σχοβοδξωκ ώμεξ τςεξδα.                  *
! *       SH  ( REAL*8    )  --  υημοχοκ λοόζζιγιεξτ τςεξδα.             *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *  IUER  ( INTEGER*4, OPT )  -- παςανετς οϋιβλι:                       *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *      IUER=1  --  παςανετς  DR  ξεδοστυπεξ δμρ ϊαπισι.                *
! *      IUER=2  --  παςανετς  SH  ξεδοστυπεξ δμρ ϊαπισι.                *
! *      IUER=3  --  όμενεξτοχ, πο λοτοςων στςοιτσρ ςεηςεσσιοξξαρ πςρναρ *
! *                  νεξψϋε 2 .                                          *
! *      IUER=4  --  χξυτςεξξρρ οϋιβλα: οπςεδεμιτεμψ πο νοδυμΰ νεξψϋε    *
! *                  1.D-30.                                             *
! *                                                                      *
! *  ###  06-MAY-91     REGRW8    V1.5  (c) πΕΤÒΟΧ μ.ΰ.  01-DEC-97  ###  *
! *                                                                      *
! ************************************************************************
        IMPLICIT  NONE
        INTEGER*4 N, IUER
        REAL*8    T(N), D(N), W(N), DR, SH
        INTEGER*4 IV(*), J1, NZ, I_LEN
        REAL*8    SD, ST, SDT, TT, STT, DET, DX, DY, WEI, SW
        CHARACTER STR*10
        LOGICAL   W_PRES, IV_PRES
!
! .....................\\\
!                       \\\
!        LOGICAL PRESENT, PROBE_W, PROBE_R, IV_PRES, W_PRES
!        INTEGER*4 NUM$ARG, NA, N_ARG
!C
!        PARAMETER ( N_ARG=8 )  !  λομιώεστχο ζοςναμψξωθ παςανετςοχ
!C
!C ----- πςοχεςλα σοοτχετστχιρ λομιώεστχα ζαλτιώεσλιθ ι ζοςναμψξωθ παςαντςοχ
!C
!        NA=NUM$ARG()  !  Mω υϊξαμι λομιώεστχο ζαλτιώεσλιθ παςανετοχ
!        IF ( .NOT. ( NA.EQ.N_ARG .OR. ( .NOT. PRESENT ( IUER, N_ARG  )
!     $       .AND.   NA.EQ.(N_ARG-1) ) ) )    CALL VER$ARG ( N_ARG )
!C                        ///
!C ......................///  ...   λοξεγ πςοχεςλι  ...
!C
!        IF ( .NOT. PROBE_W ( 1, 8, DR ) ) THEN
!              CALL ERR_LOG ( 1, IUER, 'REGRW8', 'παςανετς DR '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, SH ) ) THEN
!              CALL ERR_LOG ( 2, IUER, 'REGRW8', 'παςανετς SH '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( PRESENT ( W, 4 ) .AND. PROBE_R ( N, 4, W ) ) THEN
!             W_PRES=.TRUE.
!          ELSE
!             W_PRES=.FALSE.
!        END IF
!C
!        IF ( PRESENT ( IV, 5 ) .AND. PROBE_R ( N, 4, IV ) ) THEN
!             IV_PRES=.TRUE.
!          ELSE
!             IV_PRES=.FALSE.
!        END IF
!C
        IF ( LOC(W) .EQ. 0 ) THEN
             W_PRES = .FALSE.
          ELSE
             W_PRES = .TRUE.
        END IF
        IF ( LOC(IV) .EQ. 0 ) THEN
             IV_PRES = .FALSE.
          ELSE
             IV_PRES = .TRUE.
        END IF
!
        SD  = 0.0D0
        SW  = 0.0D0
        ST  = 0.0D0
        SDT = 0.0D0
        STT = 0.0D0
        NZ  = 0
!
! ----- χωώισμεξιε λοόζζιγιεξτοχ ξοςναμψξοκ σιστενω υςαχξεξικ
!
        DO 410 J1=1,N
           IF ( IV_PRES ) THEN
                IF ( IV(J1).EQ.0 ) GOTO 410
           END IF
           IF ( W_PRES ) THEN
                WEI = W(J1)
              ELSE
                WEI = 1.D0
           END IF
!
           NZ  = NZ+1
           SW  = SW + WEI**2
           SD  = SD + D(J1)*WEI**2
           TT  = T(J1)-T(1)
           ST  = ST  + TT*WEI**2
           SDT = SDT + D(J1)*TT*WEI**2
           STT = STT + TT**2 * WEI**2
  410   CONTINUE
!
! ----- ολαϊαμοσψ, ώτο ώισμο όμενεξτοχ, υώαστχυΰύιθ χ ποδσώεταθ, σμιϋλον ναμο
!
        IF ( NZ.LT.2 ) THEN
             CALL CLRCH ( STR )
             CALL INCH ( NZ, STR )
             CALL ERR_LOG ( 3, IUER, 'REGRW8', 'υώαστχυετ τομψλο '// &
     &                      STR(1:I_LEN(STR))//' όμενεξτοχ' )
             RETURN
        END IF
!
! ----- χωώισμεξιε οπςεδεμιτεμρ ξοςναμψξοκ σιστενω
!
        DET = SW*STT - ST*ST
!
! ----- χωώισμεξιε νιξοςοχ νατςιγω ξοςναμψξοκ σιστενω
!
        DX = SW*SDT - SD*ST
        DY = SD*STT - ST*SDT
!
! ----- οπεςεδεμιτεμψ σιστενω σμιϋλον ναμ
!
        IF ( DABS(DET) .LT. 1.D-30 ) THEN
             CALL ERR_LOG ( 4, IUER, 'REGRW8', 'χξυτςεξξρρ οϋιβλα: '// &
     &                      'ξυμεχοκ οπςεδεμιτεμψ' )
             RETURN
        END IF
!
! ----- ςεϋεξιε ξοςναμψξοκ σιστενω υςαχξεξικ
!
        DR = DX/DET
        SH = DY/DET
        CALL ERR_LOG ( 0, IUER )
        RETURN
        END  !#!  REGRW8  #!#
!
! ------------------------------------------------------------------------
!
        SUBROUTINE DESIG8 ( N, T, X, IV, NZ, ED_I, IUER )
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα  DESIG8  οτνεώαετ όμενεξτω, λοτοςωε πςεχωϋαΰτ       *
! *     ϊαδαξξοε ώισμο σταξδαςτξωθ οτλμοξεξικ οτξοσιτεμψξο ςεηςεσσιοξξοκ *
! *     πςρνοκ τ.ε. ςαϊξοστι : X(I) - ( A*T(I) + B )                     *
! *            ηδε A  --  λοόζζιγιεξτ ξαλμοξα ςεηςεσσιοξξοκ πςρνοκ, α    *
! *                B  --  σχοβοδξωκ ώμεξ ςεηςεσσιοξξοκ πςρνοκ, α         *
! *                                                                      *
! *________________________ χθοδξωε παςανετςω: __________________________*
! *                                                                      *
! *       N  ( INTEGER*4 )  --  δμιξα νασσιχοχ.                          *
! *       T  ( REAL*8    )  --  νασσιχ αςηυνεξτα.                        *
! *       X  ( REAL*8    )  --  νασσιχ ϊξαώεξικ.                         *
! *                                                                      *
! *_____________________ νοδιζιγιςυενωε παςανετςω: ______________________*
! *                                                                      *
! *      IV  ( INTEGER*4 )  --  γεμωκ νασσιχ δμιξοκ N, οτνεώαΰύικ        *
! *                             χωβςασωχαενωε όμενεξτω. εσμι IV(I)=0,    *
! *                             το I-τωκ όμενεξτ οτνεώαετσρ λαλ χωβςοσ,  *
! *                             εσμι  IV(J)=1, το J-τωκ όμενεξτ          *
! *                             υώαστχυετ χ δαμψξεκϋιθ χωώισμεξιρθ.      *
! *                                                                      *
! *_______________________ χωθοδξωε παςανετςω: __________________________*
! *                                                                      *
! *      NZ  ( INTEGER*4 )  --  ώισμο ξεοτβςοϋεξξωθ όμενεξτοχ.           *
! *                                                                      *
! * ___________________ χθοδξοκ οπυσλαενωκ παςανετς: ___________________ *
! *                                                                      *
! *      ED_I  ( REAL*8  )  --  λομιώεστχο σταξδαςτξωθ οτλμοξεξικ,       *
! *                             λοτοςοε ξαδο πςεχωσιτψ, ώτοβω βωτψ       *
! *                             οτβςοϋεξξων .                            *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *  IUER  ( INTEGER*4, OPT )  -- παςανετς οϋιβλι:                       *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *                                                                      *
! *      πςινεώαξιε: εσμι παςανετς  ED οπυύεξ, το οξ ϊαπςαϋιχαετσρ σ     *
! *      τεςνιξαμα.  εσμι ι ξα ϊαπςοσ οτχετιτψ <χλ>, το πο υνομώαξιΰ     *
! *      ED χωβεςετσρ ςαχξων 3 .                                         *
! *                                                                      *
! *  ###  06-MAY-91     DESIG8    V1.4  (c) πΕΤÒΟΧ μ.ΰ.  08-AUG-94  ###  *
! *                                                                      *
! ************************************************************************
        REAL*8  T(N), X(N), AV, D, ED_I, VALKR, A, B
        INTEGER*4  IER
        INTEGER IV(N)
!
!        NA=NUM$ARG()
!        IF ( NA.LT.5 .AND. NA.GT.7 ) CALL VER$ARG ( 7 )
!
! ----- χωώισμεξιε λοόζζιγιεξτοχ ςεηςεσσιι A ι B
!
        CALL REGRW8 ( N, T, X, %VAL(0), IV, A, B, IER )
!
! ----- χωώισμεξιε σςεδξεηο  --  AV  ι δισπεςσιι  --  δ  ςαϊξοστι
! ----- νασσιχ-ςεηςεσσιρ
!
        CALL ERR_PASS ( IUER, IER )
        CALL DISP_TR8 ( N, T, X, A, B, IV, AV, D, NZ, IER )
        IF ( IER.GT.0 ) THEN
             CALL ERR_LOG ( IER, IUER, 'DESIG8', 'aa' )
             RETURN
        END IF
!
! ----- ϊαδαξιε  ED  --  ώισμο σταξδαςτξωθ οτλμοξεξικ οτξοσιτεμψξο
! ----- ςεηςεσσιοξξοκ πςρνοκ, βομψϋε λοτοςωθ σμεδυεT όμενεξτ οτνεώατψ λαλ
! ----- χωβςοσ
!
!        IF ( NA.EQ.5 ) THEN
!             TYPE 110
!  110        FORMAT(1X/2X,'???  ισλμΰώιτψ χωβςοσω, λοτοςωε πςεχωϋαΰτ'/
!     *       2X,'σλομψλο σςεδξελχαδςατιώξωθ οτλμοξεξικ  <3.>  ? '$)
!             ACCEPT 120,IQ,ED
!  120        FORMAT(Q,G15.7)
!             IF( IQ.EQ.0 ) ED=3.   !  πο υνομώαξιΰ  ED=3
!          ELSE
!             ED=ED_I
!             IF ( ED .LT. 1.D-5 ) ED=3.
!        END IF
         ED=ED_I
         IF ( ED .LT. 1.D-5 ) ED=3.0
!
! ##### ξαώαμο ιτεςατιχξοηο γιλμα
!
  610   IDEL=0
        VALKR=ED*D
        DO 410 J1=1,N
           IF( IV(J1) .EQ. 0 ) GOTO 410
!
! -------- IDEL  --  ώισμο ισλμΰώεξξωθ όμνεξτοχ ξα δαξξον ϋαηε γιλμα
!
           TT=T(J1)-T(1)
           IF( DABS( (X(J1)-AV)-(A*TT+B) ) .GT. VALKR ) IDEL=IDEL+1
           IF( DABS( (X(J1)-AV)-(A*TT+B) ) .GT. VALKR ) IV(J1)=0
  410   CONTINUE
!
! ----- εύε ςαϊ χωώισμεξιε σςεδξεηο ι δισπεςσιι
!
        CALL REGRW8 ( N, T, X, %VAL(0), IV, A, B, IER )
        CALL ERR_PASS ( IUER, IER )
        CALL DISP_TR8 ( N, T, X, A, B, IV, AV, D, NZ, IER )
        IF ( IER.GT.0 ) THEN
             CALL ERR_LOG ( IER, IUER, 'DESIG8', 'bb' )
             RETURN
        END IF
!
! ----- εσμι ξα δαξξον ϋαηε ισλμΰώεξξωθ όμενεξτοχ ξετ  --  το χωθοδ ιϊ γιλμα
!
        IF ( IDEL .EQ. 0 ) THEN
             CALL ERR_LOG ( 0, IUER )
             RETURN
        END IF
        GOTO 610
!
! ##### λοξεγ ιτεςατιχξοηο γιλμα
!
        END  !#!  DESIG8  #!#
!
! ------------------------------------------------------------------------
!
        SUBROUTINE REGRV_EL8 ( N, T, D, IV, IV_EL, A, B, IUER )
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα χωώισμεξιρ υημοχοηο λοόζζιγιεξτα ι σχοβοδξοηο ώμεξα *
! *     ςεηςεσσιοξξοκ πςρνοκ ζυξλγιι D(T) .                              *
! *                                                                      *
! *     ισπομψϊυετσρ χελτος υώαστιρ, λοτοςωκ οτνεώαετ όμενεξτω, λοτοςωε  *
! *     βυδυτ ςασσνατςιχατψσρ. χ οβςαβοτλυ βυδυτ χλμΰώατψσρ τομψλο τε    *
! *     όμενεξτω, δμρ λοτοςωθ IV(I)=IV_EL .                              *
! *                                                                      *
! *                                                                      *
! * ------------------------- χθοδξωε παςνετςω: ------------------------ *
! *                                                                      *
! *        N  ( INTEGER*4 )  --  ώισμο όμενεξτοχ υ χελτοςοχ  D  ι  T .   *
! *        T  ( REAL*8    )  --  χελτος αςηυνεξτοχ ζυξλγιι D .           *
! *        D  ( REAL*8    )  --  χελτος ϊξαώεξικ ζυξλγιι, δμρ λοτοςοκ    *
! *                              χωώισμρετσρ δισπεςσιρ ι σςεδξεε.        *
! *       IV  ( INTEGER*4 )  --  χελτος υώαστιρ.                         *
! *     IV_EL ( INTEGER*4 )  --  ϊξαώεξιε, λοτοςοε υλαϊωχαετ ξα          *
! *                              ισπομψϊυενωκ όμενεξτ.
! *                                                                      *
! * ------------------------- χωθοδξωε παςνετςω: ----------------------- *
! *                                                                      *
! *        A  ( REAL*8    )  --  υημοχοκ λοόζζιγιεξτ τςεξδα.             *
! *        B  ( REAL*8    )  --  σχοβοδξωκ ώμεξ τςεξδα.                  *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *  IUER  ( INTEGER*4, OPT )  -- παςανετς οϋιβλι:                       *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *      IUER=1  --  παςανετς  A  ξεδοστυπεξ δμρ ϊαπισι.                 *
! *      IUER=2  --  παςανετς  B  ξεδοστυπεξ δμρ ϊαπισι.                 *
! *      IUER=3  --  όμενεξτοχ, πο λοτοςων στςοιτσρ ςεηςεσσιοξξαρ πςρναρ *
! *                  νεξψϋε 2 .                                          *
! *      IUER=4  --  χξυτςεξξρρ οϋιβλα: οπςεδεμιτεμψ πο νοδυμΰ νεξψϋε    *
! *                  1.D-30.                                             *
! *                                                                      *
! *  ###  13-JUL-91   REGRV_EL8   V1.4  (c) πΕΤÒΟΧ μ.ΰ.  08-AUG-94  ###  *
! *                                                                      *
! ************************************************************************
        REAL*8    T(N), D(N), A, B
        INTEGER*4 IV(N), IV_EL
        REAL*8    SD, ST, SDT, STT, DET, DX, DY
        CHARACTER STR*10
!
! .....................\\\
!                       \\\
!        LOGICAL PRESENT, PROBE_W, PROBE_R, IV_PRES
!        INTEGER*4 NUM$ARG, NA, N_ARG
!C
!        PARAMETER ( N_ARG=8 )  !  λομιώεστχο ζοςναμψξωθ παςανετςοχ
!C
!C ----- πςοχεςλα σοοτχετστχιρ λομιώεστχα ζαλτιώεσλικθ ι ζοςναμψξωθ παςαντςοχ
!C
!        NA=NUM$ARG()  !  Mω υϊξαμι λομιώεστχο ζαλτιώεσλιθ παςανετοχ
!        IF ( .NOT. ( NA.EQ.N_ARG .OR. ( .NOT. PRESENT ( IUER, N_ARG  )
!     $       .AND.   NA.EQ.(N_ARG-1) ) ) )    CALL VER$ARG ( N_ARG )
!C                        ///
!C ......................///  ...   λοξεγ πςοχεςλι  ...
!C
!        IF ( .NOT. PROBE_W ( 1, 8, A ) ) THEN
!              CALL ERR_LOG ( 1, IUER, 'REGRV_EL8', 'παςανετς A '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, B ) ) THEN
!              CALL ERR_LOG ( 2, IUER, 'REGRV_EL8', 'παςανετς B '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_R ( N, 4, IV ) ) THEN
!              CALL ERR_LOG ( 5, IUER, 'REGRV_EL8', 'παςανετς IV '//
!     $                                'ξεδοστυπεξ δμρ ώτεξιρ' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_R ( 1, 4, IV_EL ) ) THEN
!              CALL ERR_LOG ( 6, IUER, 'REGRV_EL8', 'παςανετς IV_EL '//
!     $                                'ξεδοστυπεξ δμρ ώτεξιρ' )
!              RETURN
!        END IF
!
        SD= 0.0D0
        ST= 0.0D0
        SDT=0.0D0
        STT=0.0D0
        NZ=0
!
! ----- χωώισμεξιε λοόζζιγιεξτοχ ξοςναμψξοκ σιστενω υςαχξεξικ
!
        DO 410 J1=1,N
           IF ( IV(J1).EQ.IV_EL ) THEN
                NZ=NZ+1
                SD=SD+D(J1)
                TT=T(J1)-T(1)
                ST=ST+TT
                SDT=SDT+D(J1)*TT
                STT=STT+TT**2
           END IF
  410   CONTINUE
!
! ----- ολαϊαμοσψ, ώτο ώισμο όμενεξτοχ, υώαστχυΰύιθ χ ποδσώεταθ, σμιϋλον ναμο
!
        IF ( NZ.LT.2 ) THEN
             CALL CLRCH ( STR )
             CALL INCH ( NZ, STR )
             CALL ERR_LOG ( 3, IUER, 'REGRV_EL8', 'υώαστχυετ τομψλο '// &
     &                      STR(1:I_LEN(STR))//' όμενεξτοχ' )
             RETURN
        END IF
!
! ----- χωώισμεξιε οπςεδεμιτεμρ ξοςναμψξοκ σιστενω
!
        DET=NZ*STT-ST*ST
!
! ----- χωώισμεξιε νιξοςοχ νατςιγω ξοςναμψξοκ σιστενω
!
        DX=NZ*SDT-SD*ST
        DY=SD*STT-ST*SDT
!
! ----- οπεςεδεμιτεμψ σιστενω σμιϋλον ναμ
!
        IF ( DABS(DET) .LT. 1.D-30 ) THEN
             CALL ERR_LOG ( 4, IUER, 'REGRV_EL8', 'χξυτςεξξρρ οϋιβλα: '// &
     &                      'ξυμεχοκ οπςεδεμιτεμψ' )
             RETURN
        END IF
!
! ----- ςεϋεξιε ξοςναμψξοκ σιστενω υςαχξεξικ
!
        A=DX/DET
        B=DY/DET
        CALL ERR_LOG ( 0, IUER )
        END  !#!  REGRV_EL8  #!#
!
! ------------------------------------------------------------------------
!
!
        SUBROUTINE DESIG_EL8 ( N, T, X, IV, IV_EL, ED, NZ, SH, DR, IUER)
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα  DESIG_EL8  οτνεώαετ όμενεξτω, λοτοςωε πςεχωϋαΰτ    *
! *     ϊαδαξξοε ώισμο σταξδαςτξωθ οτλμοξεξικ οτξοσιτεμψξο ςεηςεσσιοξξοκ *
! *     πςρνοκ τ.ε. ςαϊξοστι : X(I) - ( SH + DR*T(I) )                   *
! *            ηδε  SH  --  σχοβοδξωκ ώμεξ ςεηςεσσιοξξοκ πςρνοκ.         *
! *                 DR  --  λοόζζιγιεξτ ξαλμοξα ςεηςεσσιοξξοκ πςρνοκ.    *
! *                                                                      *
! *________________________ χθοδξωε παςανετςω: __________________________*
! *                                                                      *
! *       N  ( INTEGER*4 )  --  δμιξα νασσιχοχ.                          *
! *       T  ( REAL*8    )  --  νασσιχ αςηυνεξτα.                        *
! *       X  ( REAL*8    )  --  νασσιχ ϊξαώεξικ.                         *
! *   IV_EL  ( INTEGER*4 )  --  ϊξαώεξιε, λοτοςοε υλαϊωχαετ ξα           *
! *                             ισπομψϊυενωκ όμενεξτ.                    *
! *      ED  ( REAL*8    )  --  λομιώεστχο σταξδαςτξωθ οτλμοξεξικ,       *
! *                             λοτοςοε ξαδο πςεχωσιτψ, ώτοβω βωτψ       *
! *                             οτβςοϋεξξων.                             *
! *                                                                      *
! *_______________________ χωθοδξωε παςανετςω: __________________________*
! *                                                                      *
! *      NZ  ( INTEGER*4 )  --  ώισμο ξεοτβςοϋεξξωθ όμενεξτοχ.           *
! *      SH  ( REAL*8    )  --  σχοβοδξωκ ώμεξ ςεηςεσσιοξξοκ πςρνοκ.     *
! *      DR  ( REAL*8    )  --  λοόζζιγιεξτ ξαλμοξα ςεηςεσσιοξξοκ πςρνοκ *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *      IV  ( INTEGER*4 )  --  χελτος υώαστιρ.                          *
! *    IUER  ( INTEGER*4, OPT )  --  παςανετς οϋιβλι:                    *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *                                                                      *
! *  ###  14-JUL-92   DESIG_EL8   V1.4  (c) πΕΤÒΟΧ μ.ΰ.  08-AUG-94  ###  *
! *                                                                      *
! ************************************************************************
        IMPLICIT   NONE 
        INTEGER    N, IV(N), IV_EL, NZ, IUER
        REAL*8     T(N), X(N), ED, AV, D, VALKR, SH, DR
        REAL*8     TT
        INTEGER*4  J1, J2, IDEL, IER
        INTEGER*4, EXTERNAL :: ILEN, I_LEN
!
! .....................\\\
!                       \\\
!        LOGICAL PRESENT
!        INTEGER*4 NUM$ARG, NA, N_ARG
!C
!        PARAMETER ( N_ARG=10 )  !  λομιώεστχο ζοςναμψξωθ παςανετςοχ
!C
!!C ----- πςοχεςλα σοοτχετστχιρ λομιώεστχα ζαλτιώεσλιθ ι ζοςναμψξωθ παςανετςοχ
!C
!        NA=NUM$ARG()  !  Mω υϊξαμι λομιώεστχο ζαλτιώεσλιθ παςανετςοχ
!        IF ( .NOT. ( NA.EQ.N_ARG .OR. ( .NOT. PRESENT ( IUER, N_ARG )
!     $       .AND.   NA.EQ.(N_ARG-1) ) ) )    CALL  VER$ARG ( N_ARG )
!C                        ///
!C ......................///  ...   λοξεγ πςοχεςλι  ...
!C
!
! ----- χωώισμεξιε λοόζζιγιεξτοχ ςεηςεσσιι SH ι DR
!
        CALL ERR_PASS  ( IUER, IER )
        CALL REGRV_EL8 ( N, T, X, IV, IV_EL, DR, SH, IER )
        IF ( IER.GT.0 ) THEN
             CALL ERR_LOG ( IER, IUER, 'DESIG_EL8', &
     &                     'οϋιβλα χ DISP_TREL8' )
             RETURN
        END IF
!
! ----- χωώισμεξιε σςεδξεηο  --  AV  ι δισπεςσιι  --  D  ςαϊξοστι
! ----- νασσιχ-ςεηςεσσιρ
!
        CALL ERR_PASS  ( IUER, IER )
        CALL DISP_TREL8 ( N, T, X, DR, SH, IV, IV_EL, AV, D, NZ, IER )
        IF ( IER.GT.0 ) THEN
             CALL ERR_LOG ( IER, IUER, 'DESIG_EL8', &
     &                     'οϋιβλα χ DISP_TREL8' )
             RETURN
        END IF
!
! ##### ξαώαμο ιτεςατιχξοηο γιλμα
!
        DO 410 J1=1,N
           IDEL=0
           VALKR=ED*D
           DO 420 J2=1,N
              IF ( IV(J2).EQ.IV_EL ) THEN
!
! --------------- IDEL  --  ώισμο ισλμΰώεξξωθ όμνεξτοχ ξα δαξξον ϋαηε γιλμα
!
                  TT=T(J2)-T(1)
                  IF ( DABS ( (X(J2)-AV)-(SH+DR*TT) ) .GT. VALKR ) THEN
!
! -------------------- υ δαξξοηο ξαβμΰδεξιρ ξεχρϊλα πςεχωσιμα ποςοη
!
                       IDEL=IDEL+1
                       IV(J2)=0
                  END IF
              END IF
  420      CONTINUE
           IF ( (NZ-IDEL).LT.3 ) THEN
                CALL ERR_LOG ( 13, IUER, 'DESIG_TREL8', 'χωβςοϋεξω '// &
     &                        'χσε όμενεξετω' )
                RETURN
           END IF
!
! -------- εύε ςαϊ χωώισμεξιε παςανετςοχ ςεηςεσιοξξοκ πςρνοκ
!
           CALL ERR_PASS  ( IUER, IER )
           CALL REGRV_EL8  ( N, T, X, IV, IV_EL, DR, SH, IER )
!
! -------- εύε ςαϊ χωώισμεξιε σςεδξεηο ι δισπεςσιι
!
           CALL ERR_PASS  ( IUER, IER )
           CALL DISP_TREL8 ( N, T, X, DR, SH, IV, IV_EL, AV, D, NZ, IER)
           IF ( IER.GT.0 ) THEN
                CALL ERR_LOG ( IER, IUER, 'DESIG_EL8', &
     &                        'οϋιβλα χ DISP_TREL' )
                RETURN
           END IF
!
! -------- εσμι ξα δαξξον ϋαηε ισλμΰώεξξωθ όμενεξτοχ ξετ  --  το χωθοδ ιϊ γιλμα
!
           IF ( IDEL.EQ.0 ) THEN
                CALL ERR_LOG ( 0, IUER )
                RETURN
           END IF
  410   CONTINUE
        CALL ERR_LOG ( 7, IUER, 'DESIG_EL8', 'ιτεςαγιι ςαϊοϋμισψ' )
        RETURN
!
! ##### λοξεγ ιτεςατιχξοηο γιλμα
!
        END  !#!  DESIG_EL8  #!#
!
! ------------------------------------------------------------------------
!
        SUBROUTINE WDISP8 ( N, X, W, IV, AV, D, DW, DSW, NZ, IUER )
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα WDISP8 χωώισμρετ λοςεξψ λχαδςατξωκ ιϊ ξεχϊχεϋεξξοκ  *
! *     δισπεςσιι -- D, λοςεξψ λχαδςατξωκ ιϊ χϊχεϋεξξοκ δισπεςσιι,       *
! *     ϋλαμιςοχαξξοκ ξα σςεδξεε ϊξαώεξιε  - DW, λοςεξψ λχαδςατξωκ ιϊ    *
! *     χϊχεϋεξξοκ δισπεςσιι - DSW, σςεδξεε  -- AV  ι ώισμο              *
! *     ισπομψϊοχαξξωθ οτσώετοχ  --  NZ  δμρ  νασσιχα  X  δμιξοκ N.      *
! *     W  --  νασσιχ χεσοχ χεμιώιξω X.                                  *
! *     ισπομψϊυετσρ νασσιχ  IV, σοστορύικ ιϊ  0 ιμι 1, λοτοςωκ οτνεώαετ *
! *     ξεισπομψϊοχαξξωε οτσώετω. εσμι  IV(I)=1, το  I-τωκ οτσώετ        *
! *     υώαστχυετ χ οβςαϊοχαξιι σςεδξεηο ι δισπεςσιι, εσμι  IV(J)=0, το  *
! *     J-τωκ όμενεξτ ισλμΰώαετσρ ιϊ ποδσώετοχ.                          *
! *                                                                      *
! * ------------------------- χθοδξωε παςνετςω: ------------------------ *
! *                                                                      *
! *        N  ( INTEGER*4 )  --  ώισμο όμενεξτοχ υ χελτοςα  X .          *
! *        X  ( REAL*8    )  --  χελτος, δμρ λοτοςοηο σώιταετσρ          *
! *                              δισπεςσιρ ι σςεδξεε.                    *
! *        W  ( REAL*8    )  --  χελτος χεσοχ χεμιώιξω X.                *
! *       IV  ( INTEGER*4, OPT )  --  χελτος, υλαϊωχαΰύικ ξα ισλμΰώ‚ξξωε *
! *                              ιϊ ποδσώετοχ όμενεξτω.                  *
! *                              εσμι παςανετς  IV  οπυύεξ, ισπομψϊυΰτσρ *
! *                              χσε όμενεξτω.                           *
! *                                                                      *
! * ------------------------- χωθοδξωε παςνετςω: ----------------------- *
! *                                                                      *
! *       AV  ( REAL*8    )  --  σςεδξεε ιϊ NZ όμενεξτοχ νασσιχα X .     *
! *        D  ( REAL*8    )  --  R.M.S. δμρ NZ όμενεξτοχ νασσιχα X .     *
! *       DW  ( REAL*8    )  --  ϋλαμιςοχαξξαρ ξα σςεδξεε ϊξαώεξιε       *
! *                              χεσα W.R.M.S. δμρ NZ όμενεξτοχ νασσιχα X*
! *      DSW  ( REAL*8    )  --  W.R.M.S. δμρ NZ όμενεξτοχ νασσιχα X .   *
! *       NZ  ( INTEGER*4, OPT )  --  ώισμο όμενεξτοχ, λοτοςωε χ         *
! *                              χ υώαστχοχοαμι ποδσώετε.                *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *  IUER  ( INTEGER*4, OPT )  -- παςανετς οϋιβλι:                       *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *      IUER=1  --  παςανετς  A  ξεδοστυπεξ δμρ ϊαπισι.                 *
! *      IUER=2  --  παςανετς  D  ξεδοστυπεξ δμρ ϊαπισι.                 *
! *      IUER=3  --  όμενεξτοχ, πο λοτοςων χωώισμρετσρ δισπεςσιρ,        *
! *                  νεξψϋε 2 .                                          *
! *      IUER=4  --  παςανετς  DW ξεδοστυπεξ δμρ ϊαπισι.                 *
! *                                                                      *
! *  ###  04-JUN-93     WDISP8    V2.6  (c) πΕΤÒΟΧ μ.ΰ.  20-OCT-95  ###  *
! *                                                                      *
! ************************************************************************
        IMPLICIT   NONE 
        INTEGER    N, IV(N), NZ, IUER
        REAL*8     X(N), W(N), D, AV, DW, DSW, WW
        CHARACTER  STR*10
        INTEGER*4  J1, J2, NZZ
        LOGICAL*4  IV_PRES
        INTEGER*4, EXTERNAL :: ILEN, I_LEN
!
! .....................\\\
!                       \\\
!        LOGICAL   PRESENT, PROBE_W, PROBE_R, IV_PRES
!        INTEGER*4 NUM$ARG, NA, N_ARG
!C
!        PARAMETER ( N_ARG=10 )  !  λομιώεστχο ζοςναμψξωθ παςανετςοχ
!C
!C ----- πςοχεςλα σοοτχετστχιρ λομιώεστχα ζαλτιώεσλικθ ι ζοςναμψξωθ παςαντςοχ
!C
!        NA=NUM$ARG()  !  Mω υϊξαμι λομιώεστχο ζαλτιώεσλιθ παςανετοχ
!        IF ( .NOT. ( NA.EQ.N_ARG .OR. ( .NOT. PRESENT ( IUER, N_ARG  )
!     $       .AND.   NA.EQ.(N_ARG-1) ) ) )    CALL VER$ARG ( N_ARG )
!C                        ///
!C ......................///  ...   λοξεγ πςοχεςλι  ...
!C
!        IF ( .NOT. PROBE_W ( 1, 8, AV ) ) THEN
!              CALL ERR_LOG ( 1, IUER, 'WDISP8', 'παςανετς AV '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, D ) ) THEN
!              CALL ERR_LOG ( 2, IUER, 'WDISP8', 'παςανετς D '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, DW ) ) THEN
!              CALL ERR_LOG ( 3, IUER, 'WDISP8', 'παςανετς DW '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, DSW ) ) THEN
!              CALL ERR_LOG ( 4, IUER, 'WDISP8', 'παςανετς DSW '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!
!        IF ( PROBE_R ( N, 4, IV ) ) THEN
!             IV_PRES=.TRUE.
!          ELSE
!             IV_PRES=.FALSE.
!        END IF
!
        IF ( LOC(IV) .EQ. 0 ) THEN
             IV_PRES = .FALSE.
          ELSE
             IV_PRES = .TRUE.
        END IF
!
! ----- ξαώαμψξωε οβξυμεξιρ
!
        AV=0.D0
        NZZ=0
!
! ----- χωώισμεξιε σςεδξεηο
!
        DO 410 J1=1,N
           IF ( IV_PRES ) THEN
                IF ( IV(J1).EQ.0 ) GOTO 410
           END IF
           NZZ=NZZ+1             !  NZZ  --  ώισμο υώαστχοχαχϋιθ
!                                !           χ ποδσώεταθ όμενεξτοχ
           AV=AV+X(J1)
 410   CONTINUE
!
! ----- ολαϊαμοσψ, ώτο ώισμο όμενεξτοχ, υώαστχυΰύιθ χ ποδσώεταθ, σμιϋλον ναμο
!
        IF ( NZZ.LT.2 ) THEN
             CALL CLRCH   ( STR )
             CALL INCH    ( NZZ, STR )
             CALL ERR_LOG ( 3, IUER, 'WDISP8', 'υώαστχυετ τομψλο '// &
     &                      STR(1:I_LEN(STR))//' όμενεξτοχ' )
!!             IF ( PRESENT ( NZ, 8 ) .AND. PROBE_W ( 1, 4, NZ ) ) NZ=NZZ
             IF ( LOC(NZ) .NE. 0 ) NZ = NZZ
             RETURN
        END IF
        AV=AV/NZZ
!
! ----- χωώισμεξιε δισπεςσιι
!
        D  = 0.0D0
        DW = 0.0D0
        WW = 0.0D0
        DO 420 J2=1,N
           IF ( IV_PRES ) THEN
                IF ( IV(J2).EQ.0 ) GOTO 420
           END IF
           D=D   + ( X(J2)-AV )**2
           DW=DW + ( W(J2)* (X(J2)-AV) )**2
           WW=WW +   W(J2)**2
  420   CONTINUE
!
        IF ( DABS(WW) .LT. 1.D-30 ) THEN
             WRITE ( 6,  * ) ' WW=',WW,' NZZ=',NZZ
             CALL ERR_LOG ( 4, IUER, 'WDISP', 'ισπομψϊοχαξξωε '// &
     &                      'χεσα ολαϊαμισψ ξυμεχωνι' )
             RETURN
        END IF
!
! ----- πςοχςελα: δοστατοώξοε μι ώισμο όμενεξτοχ ?
!
        D   = DSQRT ( D/(NZZ-1) )
        DSW = DSQRT ( DW/NZZ    )
        DW  = DSQRT ( DW/WW     )
!!        IF ( PRESENT ( NZ, 8 ) .AND. PROBE_W ( 1, 4, NZ ) ) NZ=NZZ
        IF ( LOC(NZ) .NE. 0 ) NZ=NZZ
        CALL ERR_LOG ( 0, IUER )
        RETURN
        END  !#!  WDISP8  #!#
!
! ------------------------------------------------------------------------
!
        SUBROUTINE WDISP_EL8 ( N, X, W, IV, IV_EL, AV, D, DW, DSW, &
     &                         CHI, NZ, IUER )
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα  WDISP_EL8  χωώισμρετ λοςεξψ λχαδςατξωκ ιϊ          *
! *     ξεχϊχεϋεξξοκ δισπεςσιι -- D, λοςεξψ λχαδςατξωκ ιϊ χϊχεϋεξξοκ     *
! *     δισπεςσιι, ϋλαμιςοχαξξοκ ξα σςεδξεε ϊξαώεξιε  - DW, λοςεξψ       *
! *     λχαδςατξωκ ιϊ χϊχεϋεξξοκ δισπεςσιι - DSW, σςεδξεε  -- AV  ι      *
! *     ώισμο ισπομψϊοχαξξωθ οτσώετοχ  --  NZ  δμρ  νασσιχα  X δμιξοκ N. *
! *     W  --  νασσιχ χεσοχ χεμιώιξω X.                                  *
! *     ισπομψϊυετσρ νασσιχ  IV, λοτοςωκ οτνεώαετ ισπομψϊυενωε οτσώετω.  *
! *     πςι ότον ισπομψϊυετσρ τομψλο τε οτσώ‚τω  X(I), δμρ λοτοςωθ       *
! *     IV(I)=IV_EL.                                                     *
! *                                                                      *
! * ------------------------- χθοδξωε παςνετςω: ------------------------ *
! *                                                                      *
! *        N  ( INTEGER*4 )  --  ώισμο όμενεξτοχ υ χελτοςα  X .          *
! *        X  ( REAL*8    )  --  χελτος, δμρ λοτοςοηο σώιταετσρ          *
! *                              δισπεςσιρ ι σςεδξεε.                    *
! *        W  ( REAL*8    )  --  χελτος χεσοχ χεμιώιξω X.                *
! *       IV  ( INTEGER*4, OPT )  --  χελτος, υλαϊωχαΰύικ ξα ισλμΰώεξξωε *
! *                              ιϊ ποδσώετοχ όμενεξτω.                  *
! *                              εσμι παςανετς  IV  οπυύεξ, ισπομψϊυΰτσρ *
! *                              χσε όμενεξτω.                           *
! *     IV_EL ( INTEGER*4, OPT ) --   ϊξαώεξιε, υλαϊωχαΰύεε ξα           *
! *                              ισπομψϊυενωκ οτσώ‚τ.                    *
! *                                                                      *
! * ------------------------- χωθοδξωε παςνετςω: ----------------------- *
! *                                                                      *
! *       AV  ( REAL*8    )  --  σςεδξεε ιϊ NZ όμενεξτοχ νασσιχα X .     *
! *        D  ( REAL*8    )  --  R.M.S. δμρ NZ όμενεξτοχ νασσιχα X .     *
! *       DW  ( REAL*8    )  --  ϋλαμιςοχαξξαρ ξα σςεδξεε ϊξαώεξιε       *
! *                              χεσα W.R.M.S. δμρ NZ όμενεξτοχ νασσιχα X*
! *      DSW  ( REAL*8    )  --  W.R.M.S. δμρ NZ όμενεξτοχ νασσιχα X .   *
! *      CHI  ( REAL*8    )  --  θι-λχαδςατ ξα στεπεξψ σχοβοδω.          *
! *       NZ  ( INTEGER*4 )  --  ώισμο όμενεξτοχ, λοτοςωε υώαστχοχαμι χ  *
! *                              ποδσώετε.                               *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *  IUER  ( INTEGER*4, OPT )  -- παςανετς οϋιβλι:                       *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *      IUER=1  --  παςανετς  A  ξεδοστυπεξ δμρ ϊαπισι.                 *
! *      IUER=2  --  παςανετς  B  ξεδοστυπεξ δμρ ϊαπισι.                 *
! *      IUER=3  --  όμενεξτοχ, πο λοτοςων χωώισμρετσρ δισπεςσιρ,        *
! *                  νεξψϋε 2 .                                          *
! *                                                                      *
! *  ###  21-JUN-94   WDISP_EL8   V1.6  (c) πΕΤÒΟΧ μ.ΰ.  20-OCT-95  ###  *
! *                                                                      *
! ************************************************************************
        REAL*8      X(N), W(N), D, AV, DW, DSW, WW, CHI
        INTEGER     IV(N)
        CHARACTER   STR*10
        LOGICAL*4   IV_PRES
!
! .....................\\\
!                       \\\
!        LOGICAL PRESENT, PROBE_W, PROBE_R, IV_PRES
!        INTEGER*4 NUM$ARG, NA, N_ARG
!C
!        PARAMETER ( N_ARG=12 )  !  λομιώεστχο ζοςναμψξωθ παςανετςοχ
!C
!C ----- πςοχεςλα σοοτχετστχιρ λομιώεστχα ζαλτιώεσλικθ ι ζοςναμψξωθ παςαντςοχ
!C
!        NA=NUM$ARG()  !  Mω υϊξαμι λομιώεστχο ζαλτιώεσλιθ παςανετοχ
!        IF ( .NOT. ( NA.EQ.N_ARG .OR. ( .NOT. PRESENT ( IUER, N_ARG  )
!     $       .AND.   NA.EQ.(N_ARG-1) ) ) )    CALL VER$ARG ( N_ARG )
!C                        ///
!C ......................///  ...   λοξεγ πςοχεςλι  ...
!C
!        IF ( .NOT. PROBE_W ( 1, 8, AV ) ) THEN
!              CALL ERR_LOG ( 1, IUER, 'WDISP_EL8', 'παςανετς AV '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, D ) ) THEN
!              CALL ERR_LOG ( 2, IUER, 'WDISP_EL8', 'παςανετς D '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, DW ) ) THEN
!              CALL ERR_LOG ( 4, IUER, 'WDISP_EL8', 'παςανετς DW '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( .NOT. PROBE_W ( 1, 8, DW ) ) THEN
!              CALL ERR_LOG ( 4, IUER, 'WDISP_EL8', 'παςανετς DSW '//
!     $                                'ξεδοστυπεξ δμρ ϊαπισι' )
!              RETURN
!        END IF
!C
!        IF ( PROBE_R ( N, 4, IV ) ) THEN
!             IV_PRES=.TRUE.
!          ELSE
!             IV_PRES=.FALSE.
!        END IF
        IF ( LOC(IV) .EQ. 0 ) THEN
             IV_PRES = .FALSE.
          ELSE
             IV_PRES = .TRUE.
        END IF
!
! ----- ξαώαμψξωε οβξυμεξιρ
!
        AV=0.D0
        D =0.D0
        DW=0.D0
        WW=0.D0
        NZ=0
!
! ----- χωώισμεξιε σςεδξεηο
!
        DO 410 J1=1,N
           IF ( IV_PRES ) THEN
                IF ( IV(J1).EQ.0 ) GOTO 410
                IF ( IV(J1).NE.IV_EL ) GOTO 410
           END IF
           NZ=NZ+1             !  NZ  --  ώισμο υώαστχοχαχϋιθ
!                              !          χ ποδσώεταθ όμενεξτοχ
           AV=AV + X(J1)*W(J1)
           WW=WW + W(J1)
  410   CONTINUE
!
! ----- ολαϊαμοσψ, ώτο ώισμο όμενεξτοχ, υώαστχυΰύιθ χ ποδσώεταθ, σμιϋλον ναμο
!
        IF ( NZ.LT.2 ) THEN
             CALL CLRCH   ( STR )
             CALL INCH    ( NZ, STR )
             CALL ERR_LOG ( 3, IUER, 'WDISP_EL8', 'υώαστχυετ τομψλο '// &
     &                      STR(1:I_LEN(STR))//' όμενεξτοχ' )
             RETURN
        END IF
!
        IF ( DABS(WW) .LT. 1.D-30 ) THEN
             WRITE ( 6, * ) ' WW=',WW, ' NZ=',NZ
             CALL ERR_LOG ( 4, IUER, 'WDISP_EL8', 'ισπομψϊοχαξξωε '// &
     &                      'χεσα ολαϊαμισψ ξυμεχωνι' )
             RETURN
        END IF
        AV=AV/WW
        WW=0.
!
! ----- χωώισμεξιε δισπεςσιι
!
        DO 420 J2=1,N
           IF ( IV_PRES ) THEN
                IF ( IV(J2).EQ.0 ) GOTO 420
                IF ( IV(J2).NE.IV_EL ) GOTO 420
           END IF
           D=D + ( X(J2)-AV )**2
           DW=DW + ( W(J2)* ( X(J2)-AV )) **2
           WW=WW +   W(J2)**2
  420   CONTINUE
!
! ----- πςοχεςλα: δοστατοώξοε μι ώισμο όμενεξτοχ ?
!
        D   = DSQRT ( D/(NZ-1) )
        CHI = DW
        DSW = DSQRT ( DW/NZ    )
        DW  = DSQRT ( DW/WW     )
        CALL ERR_LOG ( 0, IUER )
!
        RETURN
        END  !#!  WDISP_EL8  #!#
!
! ------------------------------------------------------------------------
!
        SUBROUTINE REGR8 ( N, T, D, DR, SH, IUER )
! ************************************************************************
! *                                                                      *
! *     ποδπςοηςαννα χωώισμεξιρ υημοχοηο λοόζζιγιεξτα ι σχοβοδξοηο ώμεξα *
! *     ςεηςεσσιοξξοκ πςρνοκ ζυξλγιι D(T) .                              *
! *                                                                      *
! *     ισπομψϊυετσρ νασσιχ  IV, σοστορύικ ιϊ  0 ιμι 1 , λοτοςωκ         *
! *     οτνεώαετ ξεισπομψϊοχαξξωε οτσώετω. εσμι  IV(I)=1, το  I-τωκ      *
! *     οτσώετ υώαστχυετ χ χωώισμεξιι παςανετςοχ ςεηςεσσιοξξοκ πςρνοκ.   *
! *     εσμι  IV(J)=0, το J-τωκ όμενεξτ ισλμΰώαετσρ ιϊ ποδσώετοχ.        *
! *                                                                      *
! *                                                                      *
! * ------------------------- χθοδξωε παςνετςω: ------------------------ *
! *                                                                      *
! *        N  ( INTEGER*4 )  --  ώισμο όμενεξτοχ υ χελτοςοχ  D  ι  T .   *
! *        T  ( REAL*8    )  --  χελτος αςηυνεξτοχ ζυξλγιι D .           *
! *        D  ( REAL*8    )  --  χελτος ϊξαώεξικ ζυξλγιι, δμρ λοτοςοκ    *
! *                              χωώισμρετσρ δισπεςσιρ ι σςεδξεε.        *
! *                                                                      *
! * ------------------------- χωθοδξωε παςνετςω: ----------------------- *
! *                                                                      *
! *       DR  ( REAL*8    )  --  σχοβοδξωκ ώμεξ τςεξδα.                  *
! *       SH  ( REAL*8    )  --  υημοχοκ λοόζζιγιεξτ τςεξδα.             *
! *                                                                      *
! * ___________________ νοδιζιγιςυενωε παςανετςω: ______________________ *
! *                                                                      *
! *  IUER  ( INTEGER*4, OPT )  -- παςανετς οϋιβλι:                       *
! *             χθοδξοε ϊξαώεξιε  --  ςεφιν οβςαβοτλι οϋιβλι:            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~             *
! *      IUER>-1 -- χοϊχςαύεξιε λοδα οϋιβλι.                             *
! *      IUER=-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ ι χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ        *
! *                 χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.                       *
! *      IUER<-1 -- χοϊχςαύεξιε λοδα IUER=0 χ σμυώαε ξοςναμψξοηο         *
! *                 ϊαχεςϋεξιρ, χωχοδ διαηξοστιώεσλοηο σοοβύεξιρ ι       *
! *                 ϊαχεςϋεξιρ οβςαϊα χ σμυώαε χοϊξιλξοχεξιρ οϋιβλι.     *
! *      εσμι IUER οπυύεξ, το χθοδξοε ϊξαώεξιε πςιξιναετσρ ςαχξων -1     *
! *             χωθοδξοε ϊξαώεξιε  --  λοδ οϋιβλι ( εσμι IUER            *
! *             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                        *
! *             δοστυπεξ δμρ ϊαπισι ):                                   *
! *      IUER=0  --  ξοςναμψξοε ϊαχεςϋεξιε.                              *
! *      IUER=1  --  παςανετς  DR  ξεδοστυπεξ δμρ ϊαπισι.                *
! *      IUER=2  --  παςανετς  SH  ξεδοστυπεξ δμρ ϊαπισι.                *
! *      IUER=3  --  όμενεξτοχ, πο λοτοςων στςοιτσρ ςεηςεσσιοξξαρ πςρναρ *
! *                  νεξψϋε 2 .                                          *
! *      IUER=4  --  χξυτςεξξρρ οϋιβλα: οπςεδεμιτεμψ πο νοδυμΰ νεξψϋε    *
! *                  1.D-30.                                             *
! *                                                                      *
! *  ###  06-MAY-1991     REGR8  v1.6  (c) πΕΤÒΟΧ μ.ΰ.  26-FEB-2008 ###  *
! *                                                                      *
! ************************************************************************
        IMPLICIT  NONE
        INTEGER*4 N, IUER
        REAL*8    T(N), D(N), DR, SH
        INTEGER*4 J1
        REAL*8    SD, ST, SDT, TT, STT, DET, DX, DY, SW
        CHARACTER STR*10
!
        SD  = 0.0D0
        SW  = 0.0D0
        ST  = 0.0D0
        SDT = 0.0D0
        STT = 0.0D0
!
! ----- χωώισμεξιε λοόζζιγιεξτοχ ξοςναμψξοκ σιστενω υςαχξεξικ
!
        DO 410 J1=1,N
           SW  = SW + 1.0
           SD  = SD + D(J1)
           TT  = T(J1)-T(1)
           ST  = ST  + TT
           SDT = SDT + D(J1)*TT
           STT = STT + TT**2
  410   CONTINUE
!
! ----- χωώισμεξιε οπςεδεμιτεμρ ξοςναμψξοκ σιστενω
!
        DET = SW*STT - ST*ST
!
! ----- χωώισμεξιε νιξοςοχ νατςιγω ξοςναμψξοκ σιστενω
!
        DX = SW*SDT - SD*ST
        DY = SD*STT - ST*SDT
!
! ----- οπεςεδεμιτεμψ σιστενω σμιϋλον ναμ
!
        IF ( DABS(DET) .LT. 1.D-30 ) THEN
             CALL ERR_LOG ( 1014, IUER, 'REGR8', 'Zero determinant' )
             RETURN
        END IF
!
! ----- ςεϋεξιε ξοςναμψξοκ σιστενω υςαχξεξικ
!
        DR = DX/DET
        SH = DY/DET
        CALL ERR_LOG ( 0, IUER )
        RETURN
        END  SUBROUTINE  REGR8  !#!#
